#include <iostream>
#include <string>
#include <typeinfo>


#include <cstdio>
using namespace std;

#define EPS 1e-10					//定义非常小的一个量EPSilon，当浮点数不大于这个值时，视为0
#define PI 3.14159



// 知识点
/*
		0. inline函数可以避免函数调用的开销，可以让编译器在编译时内联地展开该函数。
	 	1. 定义在类内部的函数是自动内连的。
	 	2. inline函数应该在头文件中定义。



		
*/



/***************************************************************************
***************************************************************************/
// extern变量
extern void(*pfun[100])(void);
extern int inputTag, inputNum, interfaceLevel;



/***************************************************************************
***************************************************************************/
// 函数声明
void set_fun_function_inline(void);
void start_function_inline(void);

static void test0(void);
static void test1(void);
static void test2(void);
static void test3(void);
static void test4(void);


/***************************************************************************
***************************************************************************/
// extern函数
void traverse_pfun(void);


/***************************************************************************
***************************************************************************/
// 自定义类的实现



/***************************************************************************
***************************************************************************/
// 函数定义
void set_fun_function_inline(void) {}



void start_function_inline(void) {}




static void test0(void) {}
